app/Models/CustomModel.php

SELECT `cutis`.*, `users`.`name`
FROM `cutis`
JOIN `users` ON `users`.`id`=`cutis`.`user_id`
WHERE `user_id` = '2'
---
  public function getDataCutiByUserId($user_id)
  {
    $dbCuti = $this->db->table('cutis');
    $dbCuti->where('user_id', $user_id);
    $dbCuti->join('users', 'users.id=cutis.user_id')->select('cutis.*, users.name');

    return $dbCuti->get()->getResultArray();

SELECT `cutis`.*, `users`.`name`
FROM `cutis`
JOIN `users` ON `users`.`id`=`cutis`.`user_id`
---
  public function getAllDataCuti()
  {
    $dbCuti = $this->db->table('cutis');
    $dbCuti->join('users', 'users.id=cutis.user_id')->select('cutis.*, users.name');

    return $dbCuti->get()->getResultArray();